{"qid": 1, "question": "What is the exact title shown above the matrix of accessories and models?"}
{"qid": 2, "question": "List the five mower model groups in the header, in the order they appear from left to right."}
{"qid": 3, "question": "For the model group “ZT4200L / ZT4200E-L,” is accessory ABK4200 marked suitable or not?"}
{"qid": 4, "question": "What parenthetical note follows ABK4200-A in its description? Give the exact text."}
{"qid": 5, "question": "Which accessory code corresponds to “Zero Turn Riding Mower 1600W charger”?"}
{"qid": 6, "question": "According to the legend, what do the symbols “●” and “X” mean? Give both meanings."}
{"qid": 7, "question": "Which accessory shows an unusual “●/X” compatibility notation, and under which model group does it appear?"}
{"qid": 8, "question": "Is the CRM001 “Zero turn riding mower cover” compatible with TR3800E-B (EU)?"}
{"qid": 9, "question": "Name all model groups for which CHV1600 is marked suitable."}
{"qid": 10, "question": "For AB4200D, which model groups are marked “X”?"}
{"qid": 11, "question": "Which accessories explicitly contain “42” in their names and are compatible with TR4200 / TR4200E (EU&AU)? List codes."}
{"qid": 12, "question": "Provide the exact description text for AB4201D as printed in the PDF."}
{"qid": 13, "question": "For ZT5200L / ZT5200E-L, name every accessory that is marked suitable and contains “52” in its name."}
{"qid": 14, "question": "Which accessory’s description is written in all caps (\"HIGH-LIFT BAGGING BLADE\"), and what is its code?"}
{"qid": 15, "question": "Among AMG1000, AMS1000, and AMB1000, which are compatible with TR4200 / TR4200E (EU&AU)?"}
{"qid": 16, "question": "True or False: AMB1000 is compatible with all three ZT model groups but neither tractor model group."}
{"qid": 17, "question": "Which model group(s) include a regional qualifier “(EU&AU)” in their header label?"}
{"qid": 18, "question": "What is the compatibility of ACA1000 across all five model groups (list the five symbols in order)?"}
{"qid": 19, "question": "For ABP5200, is the item a “mulching kit” or a “mulching plug”? Quote the exact wording."}
{"qid": 20, "question": "Which accessory has the description “Zero turn riding mower on-board storage”? Provide its code."}
{"qid": 21, "question": "How many accessories on page 1 include “mulching” in their description? Give the count."}
{"qid": 22, "question": "Provide the exact parenthetical quantity noted for AB5200D."}
{"qid": 23, "question": "Which accessories list “(1pc)” or “(1pcs blade)” in their descriptions? List codes."}
{"qid": 24, "question": "For ZT4200S / ZT4200E-S, is AMP4200 suitable?"}
{"qid": 25, "question": "Which accessories are compatible with all five model groups? List codes."}
{"qid": 26, "question": "True or False: CRM001 is compatible with TR4200 / TR4200E (EU&AU)."}
{"qid": 27, "question": "Name the accessory that is a “Zero turn riding mower sun shade,” and list the model groups it supports."}
{"qid": 28, "question": "For AB5201D, which model groups are marked “X”?"}
{"qid": 29, "question": "Which accessory code corresponds to “Mulching Blade for 52“ Zero turn riding mower (1pcs blade)”? "}
{"qid": 30, "question": "For AB5201, list its compatibility symbols across the five model groups in left-to-right order."}
{"qid": 31, "question": "Which 42″ zero-turn bagger kit is offered “w/o blade,” and what is its code?"}
{"qid": 32, "question": "Counting both pages, how many total accessory rows are listed?"}
{"qid": 33, "question": "Which accessories on page 2 are exclusive (suitable only) to TR3800E-B (EU)? List codes."}
{"qid": 34, "question": "Provide the exact description (including the parenthetical note) for AB3801TD."}
{"qid": 35, "question": "On page 2, which two accessories are tractor bagging kits for 107 cm (42'') side discharge, and how are they region-labeled?"}
{"qid": 36, "question": "What additional items are specified in parentheses for ABK4200T(NA)? List them verbatim."}
{"qid": 37, "question": "True or False: ABK4200T-A (EU) includes blades."}
{"qid": 38, "question": "Which accessories on page 1 are compatible with all three ZT model groups and with TR4200 / TR4200E (EU&AU), but not with TR3800E-B (EU)? "}
{"qid": 39, "question": "Provide the compatibility symbols for ABK4200 across all five model groups in order."}
{"qid": 40, "question": "Which model group header contains “(EU)” without “&AU”?"}
{"qid": 41, "question": "For AMP3800T, list the five compatibility symbols left-to-right."}
{"qid": 42, "question": "Which accessories on page 1 have codes beginning with ABK and what are their deck sizes?"}
{"qid": 43, "question": "What is the only accessory on page 1 that mentions “Charging Adaptor”? Provide its code and compatibility for each model group."}
{"qid": 44, "question": "For AB4201, provide the exact description including the parenthetical note."}
{"qid": 45, "question": "Name all “bagging blade set” accessories across both deck sizes on page 1. List codes."}
{"qid": 46, "question": "True or False: AB5200D is compatible with ZT4200L / ZT4200E-L."}
{"qid": 47, "question": "Which accessory codes include the substring “5200” and are not compatible with any tractor model? List codes."}
{"qid": 48, "question": "Provide the compatibility for ABK5200-A across the five model groups (symbols in order)."}
{"qid": 49, "question": "What is the exact wording of the column-group label that begins with “Riding Mower Model”? Quote it."}
{"qid": 50, "question": "Which accessory codes start with AM on page 1, and what are their product names?"}
{"qid": 51, "question": "Which accessories have “plug” (not “kit”) in their descriptions, and what are their codes? Consider both pages."}
{"qid": 52, "question": "For CRM001, list the full set of compatibility symbols across the model groups in order."}
{"qid": 53, "question": "True or False: ACA1000 is shown as suitable for ZT5200L / ZT5200E-L."}
{"qid": 54, "question": "Which accessories on page 1 are compatible with TR4200 / TR4200E (EU&AU) but not compatible with ZT5200L / ZT5200E-L? List codes."}
{"qid": 55, "question": "What is the exact code and description for the 52″ “mulching kit”?"}
{"qid": 56, "question": "Compare ABK4200 vs ABK4200-A: what single difference is called out in parentheses?"}
{"qid": 57, "question": "Which accessories on page 2 are compatible with TR4200 / TR4200E (EU&AU)? List codes."}
{"qid": 58, "question": "Provide the complete header text for the TR4200 / TR4200E model group including any regional qualifier."}
{"qid": 59, "question": "True or False: ABK5200 is compatible with ZT4200S / ZT4200E-S."}
{"qid": 60, "question": "Which 42″ zero-turn accessories (codes) are not compatible with TR4200 / TR4200E (EU&AU)?"}
{"qid": 61, "question": "Provide the exact description text for AB5200 (include the “(1pcs blade)” parenthetical)."}
{"qid": 62, "question": "For AMS1000, list the model groups where it is marked “●”."}
{"qid": 63, "question": "Which accessory explicitly uses the phrase “rear Bumper,” and what is its cross-model compatibility?"}
{"qid": 64, "question": "True or False: AMP4200 is marked suitable for both ZT4200 model groups and TR4200 / TR4200E (EU&AU)."}
{"qid": 65, "question": "Which model group(s) are compatible with ABP5200?"}
{"qid": 66, "question": "Provide the exact spacing and punctuation around “52 ” (with the closing quote) as it appears in the ABP5200 description."}
{"qid": 67, "question": "Which accessories on page 1 have descriptions containing “bagger kit”? List codes and deck sizes."}
{"qid": 68, "question": "For AB4200, list all model groups where it is marked suitable."}
{"qid": 69, "question": "Which page contains the legend explaining “●” and “X”?"}
{"qid": 70, "question": "What is the exact phrasing of the legend items for “●” and for “X”? Quote both."}
{"qid": 71, "question": "True or False: ABK4200T(NA) is compatible with any ZT model group."}
{"qid": 72, "question": "Which accessories (codes) include a regional tag “(EU)” or “(NA)” in the code line itself?"}
{"qid": 73, "question": "For ABK4200T-A (EU), what is the deck size in centimeters and inches stated in the description?"}
{"qid": 74, "question": "Which accessories across both pages use the word “Bagging” in their description (not just “Bagger”)? List codes."}
{"qid": 75, "question": "Provide the compatibility row for ABK4200T(NA) in symbol order from ZT4200L/E-L to TR4200/TR4200E."}
{"qid": 76, "question": "Which accessories are compatible with all three ZT model groups? List codes."}
{"qid": 77, "question": "True or False: CRM001 is marked “X” for exactly one model group. Name that group."}
{"qid": 78, "question": "What accessory code is associated with “on-board storage,” and which tractor model (if any) is incompatible with it?"}
{"qid": 79, "question": "For AB5201, what is the parenthetical quantity noted in the description?"}
{"qid": 80, "question": "Which page mentions “counter weights,” and in which accessory’s description does this appear?"}
{"qid": 81, "question": "Provide the exact formatting of the TR3800E-B (EU) header label, including hyphenation and parentheses."}
{"qid": 82, "question": "Which accessories on page 1 have compatibility “X” for TR3800E-B (EU) but “●” for TR4200 / TR4200E (EU&AU)? List codes."}
{"qid": 83, "question": "True or False: CHV1600 is the only accessory on page 1 with “●” under all five model groups."}
{"qid": 84, "question": "For ABK5200, what is the compatibility symbol under ZT4200S / ZT4200E-S?"}
{"qid": 85, "question": "Which accessories on page 1 are compatible with ZT5200L / ZT5200E-L but are not compatible with either TR model group? List codes."}
{"qid": 86, "question": "Provide the exact capitalization of the word “Turn” in the CHV1600 description."}
{"qid": 87, "question": "Which accessories on page 2 are compatible only with TR4200 / TR4200E (EU&AU)? List codes."}
{"qid": 88, "question": "True or False: AB4201D is a “bagging blade set.” Quote its deck size from the description."}
{"qid": 89, "question": "Which accessories on page 1 include the word “plug,” and for each, list the model groups where they are suitable."}
{"qid": 90, "question": "For ABK4200, does the compatibility differ between the two ZT4200 model groups? Explain using the symbols shown."}
{"qid": 91, "question": "Provide the five compatibility symbols (left-to-right) for AB5200."}
{"qid": 92, "question": "Which accessories on page 1 list quantity “(3pc)” in their descriptions? List codes."}
{"qid": 93, "question": "What is the exact description text for AMP3800T?"}
{"qid": 94, "question": "Which accessories on page 1 have “bagger kit” in the description and are not compatible with TR4200 / TR4200E (EU&AU)? List codes."}
{"qid": 95, "question": "True or False: ACA1000 is compatible with ZT4200L / ZT4200E-L."}
{"qid": 96, "question": "Which accessory code corresponds to “Zero turn riding mower mulching plug” for the 42″ deck?"}
{"qid": 97, "question": "For AB3801TD, which ZT and TR4200 model groups are marked “X”? List all groups marked “X”."}
{"qid": 98, "question": "Provide the compatibility of ABK5200-A specifically under TR3800E-B (EU) and TR4200 / TR4200E (EU&AU)."}
{"qid": 99, "question": "Which accessories are compatible with TR4200 / TR4200E (EU&AU) but have “X” for both ZT5200 and TR3800E-B (EU)? List codes."}
{"qid": 100, "question": "On page 1, identify the accessories that are suitable for all three ZT model groups; among those, which are not suitable for TR4200 / TR4200E (EU&AU)? List codes."}
