{"qid": 1, "question": "What is the official customer support website listed in the manual?"}
{"qid": 2, "question": "What support email address does the manual provide?"}
{"qid": 3, "question": "What exact product model name appears on the cover?"}
{"qid": 4, "question": "What does the cover ask you to do with the owner’s manual after reading it?"}
{"qid": 5, "question": "According to the user guide, what type of socket must the power plug be connected to?"}
{"qid": 6, "question": "Before use, where should you stand when the treadmill starts?"}
{"qid": 7, "question": "What item must be clipped to your clothes to control emergencies?"}
{"qid": 8, "question": "After running, what button can you press to stop the treadmill (instead of pulling the safety key)?"}
{"qid": 9, "question": "What should you do with the power plug when you finish exercising?"}
{"qid": 10, "question": "Where should the treadmill be placed—indoors or outdoors?"}
{"qid": 11, "question": "What type of footwear is recommended when using the device?"}
{"qid": 12, "question": "What is the maximum recommended continuous running time?"}
{"qid": 13, "question": "How much safe space should be left behind the treadmill during use?"}
{"qid": 14, "question": "Why does the manual recommend keeping indoor dust low and some humidity present?"}
{"qid": 15, "question": "What immediate action is recommended at the first signs of dizziness?"}
{"qid": 16, "question": "What current rating does the manual state the machine can be used under?"}
{"qid": 17, "question": "Which test’s results are noted as “not as exact as medical devices”?"}
{"qid": 18, "question": "Which component(s) should not be opened unless by professionals?"}
{"qid": 19, "question": "According to the “Prohibit!” list, may a patient with osteoporosis use the treadmill without a doctor’s approval?"}
{"qid": 20, "question": "What body temperature threshold is considered a high fever that contraindicates use?"}
{"qid": 21, "question": "According to the list, should a pregnant person use the treadmill?"}
{"qid": 22, "question": "Does the manual advise using the treadmill after meals or when feeling tired?"}
{"qid": 23, "question": "What instruction is given about keeping children near the treadmill?"}
{"qid": 24, "question": "Where should the silicone oil bottle be stored in relation to children?"}
{"qid": 25, "question": "What does the manual say about customers disassembling or repairing the unit themselves?"}
{"qid": 26, "question": "In the event of a sudden power failure, what should you do with the plug?"}
{"qid": 27, "question": "When unplugging, what should you hold to avoid damage—plug or wire?"}
{"qid": 28, "question": "Does the treadmill require a grounded connection?"}
{"qid": 29, "question": "Are socket adapters allowed with the grounding plug provided?"}
{"qid": 30, "question": "What is the maximum load specified (in pounds)?"}
{"qid": 31, "question": "What are the folded dimensions of the treadmill (in mm)?"}
{"qid": 32, "question": "What are the unfolded dimensions of the treadmill (in mm)?"}
{"qid": 33, "question": "What is the running surface size (in mm)?"}
{"qid": 34, "question": "What is the operating speed range stated in the technical information (in mph)?"}
{"qid": 35, "question": "In the unfold instructions, which part must you turn out from the underside with your foot?"}
{"qid": 36, "question": "After lifting the stand post, what two parts do you operate to raise the monitor?"}
{"qid": 37, "question": "To what position should you pull the monitor before running?"}
{"qid": 38, "question": "In Step 1 of the folding instructions, to what level should the monitor be pushed down?"}
{"qid": 39, "question": "Which component must be pressed to lay down the monitor tray during folding?"}
{"qid": 40, "question": "To lower the stand post during folding, what action should you take with your foot?"}
{"qid": 41, "question": "Before standing the treadmill upright, what cable should be pulled off from the front of the unit?"}
{"qid": 42, "question": "Which two components are pulled out before lifting the treadmill to stand on the ground?"}
{"qid": 43, "question": "What caution is given immediately after standing the treadmill upright?"}
{"qid": 44, "question": "How many built-in automatic training programs does the monitor provide (P1–P36)?"}
{"qid": 45, "question": "How many USER programs are available?"}
{"qid": 46, "question": "Which program corresponds to manual operation?"}
{"qid": 47, "question": "Besides P0 and P1–P36, what additional mode/program is available on the console?"}
{"qid": 48, "question": "How many operation keys does the LED console have?"}
{"qid": 49, "question": "Which LED window shows distance and time values?"}
{"qid": 50, "question": "Which LED window displays calories?"}
{"qid": 51, "question": "Which LED window shows incline values?"}
{"qid": 52, "question": "Which LED window displays heart rate?"}
{"qid": 53, "question": "Which LED window shows speed?"}
{"qid": 54, "question": "Which key cycles among programs P0–P36, U01–U03, and BMI?"}
{"qid": 55, "question": "In manual mode, which key cycles through countdown time, countdown distance, countdown calories, and normal mode?"}
{"qid": 56, "question": "What is the default countdown time for P1–P36 programs?"}
{"qid": 57, "question": "Which key starts the treadmill from a stop and pauses it during running?"}
{"qid": 58, "question": "What does pressing STOP during running do?"}
{"qid": 59, "question": "What do the QUICK SPEED keys set the speed to?"}
{"qid": 60, "question": "What incline values are available via QUICK INCLINE keys?"}
{"qid": 61, "question": "When the safety key is removed, what error code is displayed?"}
{"qid": 62, "question": "After inserting the safety key, how long does the screen fully display before entering the default state?"}
{"qid": 63, "question": "In USER mode, how many segments can you set for speed and incline?"}
{"qid": 64, "question": "When you press START after selecting a mode, how long is the countdown and how many beeps occur?"}
{"qid": 65, "question": "In programs P1–P36, how many segments are there per workout?"}
{"qid": 66, "question": "What happens automatically when a P1–P36 program completes all 10 segments?"}
{"qid": 67, "question": "During running, which keys adjust the incline?"}
{"qid": 68, "question": "Which two keys must you hold together (with the safety key removed) to enter metric/imperial conversion?"}
{"qid": 69, "question": "When the display shows “0.6” during conversion, what conversion direction does that indicate?"}
{"qid": 70, "question": "When the display shows “1.0” during conversion, what conversion direction does that indicate?"}
{"qid": 71, "question": "How long after inactivity does the ERP power-saving mode put the console to sleep?"}
{"qid": 72, "question": "How do you cancel ERP mode (what long-press and code appear)?"}
{"qid": 73, "question": "How do you re-enable ERP mode (what long-press and code appear)?"}
{"qid": 74, "question": "After how many kilometers will the console display “OIL” as a lubrication reminder?"}
{"qid": 75, "question": "How do you clear the OIL warning after lubricating?"}
{"qid": 76, "question": "According to the metric speed table (pp. 23–24), what is the Level-1 speed in P1?"}
{"qid": 77, "question": "In program P7, what is the Level-4 speed value?"}
{"qid": 78, "question": "In program P10, what speed is shown at Level 10?"}
{"qid": 79, "question": "In program P12, what speed is shown at Level 1?"}
{"qid": 80, "question": "In program P21, what speed is shown at Level 3?"}
{"qid": 81, "question": "In program P23, what speed is shown at Level 1?"}
{"qid": 82, "question": "In program P35, what speed is shown at Level 3?"}
{"qid": 83, "question": "In program P24, what is the incline value at Level 2?"}
{"qid": 84, "question": "In program P16, what incline value is shown at Level 3?"}
{"qid": 85, "question": "In program P22, what incline value is shown at Level 1?"}
{"qid": 86, "question": "In program P30, what incline value is shown at Level 3?"}
{"qid": 87, "question": "In program P31, what incline value is shown at Level 4?"}
{"qid": 88, "question": "In program P36, what incline value is shown at Level 1?"}
{"qid": 89, "question": "Before moving the unit, what two power-related conditions must be true?"}
{"qid": 90, "question": "When moving, to approximately what tilt angle should the machine be leaned (toward the chest)?"}
{"qid": 91, "question": "On startup, after a 5-second delay, to what speed does the treadmill begin (in Km/h)?"}
{"qid": 92, "question": "What speed range does the manual call “the most comfortable running speed”?"}
{"qid": 93, "question": "Which feature lets you jump to a desired speed quickly during running?"}
{"qid": 94, "question": "How many gears of slope adjustment are available by physically adjusting the rear feet pad, and when can you do this?"}
{"qid": 95, "question": "For heart-rate testing, where should you place your hands?"}
{"qid": 96, "question": "Are the heart-rate readings intended for medical use?"}
{"qid": 97, "question": "According to the grounding guide, what voltage range should the wall outlet be under?"}
{"qid": 98, "question": "When decreasing belt tension, how must the two adjustment bolts be turned relative to each other?"}
{"qid": 99, "question": "After centering the belt at 6 km/h, at what speed should you verify that it runs smoothly?"}
{"qid": 100, "question": "During lubrication, roughly how long should you spray each side of the belt, and how long should you wait before starting the machine again?"}
