{"qid": 1, "question": "What model number is shown in the header of each sheet?"}
{"qid": 2, "question": "What is the exact “Product Description” line printed at the top of the sheets?"}
{"qid": 3, "question": "What “Version” is noted in the header?"}
{"qid": 4, "question": "What is the standard “Issue Date” printed on most sheets?"}
{"qid": 5, "question": "One sheet has a different “Issue Date” than the others—what is that date and which sheet is it on?"}
{"qid": 6, "question": "On page 1, what Body Number is printed in the header?"}
{"qid": 7, "question": "On page 2, what Body Number is printed in the header?"}
{"qid": 8, "question": "On page 3, what Body Number is printed in the header?"}
{"qid": 9, "question": "The exploded diagram labeled “201” (page 3) corresponds to which assembly name in the parts list?"}
{"qid": 10, "question": "The exploded diagram labeled “203” (page 5) corresponds to which assembly name?"}
{"qid": 11, "question": "The exploded diagram labeled “204” (page 6) corresponds to which assembly name?"}
{"qid": 12, "question": "The exploded diagram labeled “205” (page 7) corresponds to which assembly name?"}
{"qid": 13, "question": "The exploded diagram labeled “206” (page 8) corresponds to which assembly name?"}
{"qid": 14, "question": "The exploded diagram labeled “207” (page 9) corresponds to which assembly name?"}
{"qid": 15, "question": "The exploded diagram labeled “208” (page 10) corresponds to which assembly name?"}
{"qid": 16, "question": "The exploded diagram labeled “209” (page 11) corresponds to which assembly name?"}
{"qid": 17, "question": "The exploded diagram labeled “210” (page 12) corresponds to which assembly name?"}
{"qid": 18, "question": "The exploded diagram labeled “212” (page 14) corresponds to which assembly name?"}
{"qid": 19, "question": "In the assembly summary list, what is the part number for the “Wrench Tool Set (214)” and how many are included?"}
{"qid": 20, "question": "On the general parts list (page 15), what is the quantity for Wire Holder, part number 3131157001?"}
{"qid": 21, "question": "What are the part numbers and quantities for the Right Lift Arm Assembly and Left Lift Arm Assembly?"}
{"qid": 22, "question": "What is the part number and quantity for Motor Control System Fuse (80A)?"}
{"qid": 23, "question": "What is the part number and quantity for Footrest Pedal Assembly?"}
{"qid": 24, "question": "Two different items in the general list are labeled Lower Housing. What are their part numbers?"}
{"qid": 25, "question": "What is the part number and quantity for Decorative Cover Assembly in the general list?"}
{"qid": 26, "question": "What is the part number and quantity for Hanger Rod?"}
{"qid": 27, "question": "Which item is Pressing Sleeve and what quantity is specified?"}
{"qid": 28, "question": "What is the part number and quantity for Outer Tube Welded Assembly?"}
{"qid": 29, "question": "What is the part number and quantity for Inner Tube Welded Assembly?"}
{"qid": 30, "question": "What is the part number and quantity for Top Cover in the general list?"}
{"qid": 31, "question": "What are the part numbers for the Left Supporting Plate and Right Supporting Plate?"}
{"qid": 32, "question": "In the general list, what is the total quantity shown for Hexalobular Socket Thread Forming Screw (part number 5610388001)?"}
{"qid": 33, "question": "In the general list, how many Hex Serrated Flange Screw (part number 5640373001) are specified?"}
{"qid": 34, "question": "What is the part number and quantity for Hoop in the general list?"}
{"qid": 35, "question": "Which item number corresponds to Hitch, and what part number does it use?"}
{"qid": 36, "question": "What is the part number and quantity for Rear Wheel Set in the general list?"}
{"qid": 37, "question": "Which item lists Quick Connect Coupling, and what is its part number?"}
{"qid": 38, "question": "What is the part number and quantity for Front Wheel Set?"}
{"qid": 39, "question": "The general list contains two Support Assembly entries. What are their part numbers and quantities?"}
{"qid": 40, "question": "For Battery Box Assembly (201), what component is listed as 201-1, and what is its quantity?"}
{"qid": 41, "question": "In 201, what is the part number and quantity for BMS Electric Assembly?"}
{"qid": 42, "question": "In 201, two different lines are labeled Bottom Support. What are their part numbers and quantities?"}
{"qid": 43, "question": "In 201, what is the part number and quantity for Magnet Ring?"}
{"qid": 44, "question": "In 201, what is the quantity for Hexagon Socket Screw (part number 5620157006)?"}
{"qid": 45, "question": "What is the part number and quantity for Battery Box Cover Assembly (201-401)?"}
{"qid": 46, "question": "In the Control Electric Assembly (202), which line items mention Type-C Male-male Wire and what are their individual quantities?"}
{"qid": 47, "question": "In 202, what is the part number and quantity for the single Type-C Male-female Wire?"}
{"qid": 48, "question": "In 202, what is the part number and quantity for Connecting PCBA?"}
{"qid": 49, "question": "In 202, how many Hexagon Socket Screw (part number 5620377003) are specified?"}
{"qid": 50, "question": "In 202, what is the part number and quantity for Electrical Assembly?"}
{"qid": 51, "question": "In 202, two items are labeled PCB Box. What are the two part numbers and their quantities?"}
{"qid": 52, "question": "In 202, how many distinct Host Power Wire Harness items are listed, and what are their part numbers and quantities?"}
{"qid": 53, "question": "In 202, what is the quantity for Screw with Washer (part number 5620618001)?"}
{"qid": 54, "question": "In 202, Cord Anchorage appears more than once. What are the relevant part numbers and quantities?"}
{"qid": 55, "question": "In 202, what is the part number and quantity for Base Plate?"}
{"qid": 56, "question": "In 202, which line items are titled Motor Wire Harness (exact wording) and what are their quantities?"}
{"qid": 57, "question": "For the Drive Train Assembly (203), what is the part number and quantity for the DC Motor?"}
{"qid": 58, "question": "In 203, which items are Connecting Plate, and what are their part numbers?"}
{"qid": 59, "question": "In 203, how many Hexagon Head Bolt entries are present, and what quantities are shown for each?"}
{"qid": 60, "question": "In 203, what is the part number and quantity for Brake Disc?"}
{"qid": 61, "question": "In 203, what is the part number and quantity for Friction Block?"}
{"qid": 62, "question": "In 203, which lines reference Right Bracket Assembly and Left Bracket Assembly, and what are their part numbers?"}
{"qid": 63, "question": "In 203, what is the part number and quantity for Gear Case Assembly (203-401)?"}
{"qid": 64, "question": "For the Steering Wheel Assembly (204), what is the part number and quantity for Switch Assembly?"}
{"qid": 65, "question": "In 204, what is the part number and quantity for Damper?"}
{"qid": 66, "question": "In 204, which line describes the Timing Belt, and what is its quantity?"}
{"qid": 67, "question": "In 204, which line is the Belt Drive Assembly, and what is its part number?"}
{"qid": 68, "question": "In 204, what is the part number and quantity for Angle Measuring Electric Assembly?"}
{"qid": 69, "question": "In 204, what is the part number and quantity for Hexagon Socket Rubber Head Cap Screw?"}
{"qid": 70, "question": "For the Front Frame Assembly (205), which two lines are LED PCBA, and what are their part numbers?"}
{"qid": 71, "question": "In 205, what is the part number and quantity for the Front Frame?"}
{"qid": 72, "question": "In 205, there are two Tapping Screw entries. What part numbers and quantities are listed for each?"}
{"qid": 73, "question": "In 205, what are the part numbers for the two Transparent Guard Assembly items?"}
{"qid": 74, "question": "In 205, what is the part number and quantity for Transparent Cap Assembly?"}
{"qid": 75, "question": "In 205, what is the part number and quantity for Lamp Wire Harness?"}
{"qid": 76, "question": "For the Parking Assembly (206), what is the part number and quantity for Switch Box Assembly?"}
{"qid": 77, "question": "In 206, which line is the Pedal, and what is its part number?"}
{"qid": 78, "question": "In 206, what is the part number and quantity for Seal Packing Case?"}
{"qid": 79, "question": "In 206, what is the quantity for Hexagon Socket Screw (part number 5620377003)?"}
{"qid": 80, "question": "In 206, what is the part number and quantity for Rubber Sleeve?"}
{"qid": 81, "question": "For the Deck Unit (207), what is the part number and quantity for the Deck Unit itself (line 207-14)?"}
{"qid": 82, "question": "In 207, what is the part number and quantity for the Blade?"}
{"qid": 83, "question": "In 207, what is the part number and quantity for Chute Deflector Assembly?"}
{"qid": 84, "question": "In 207, list the fastener lines that include Hexagon Flange in the description and give their quantities."}
{"qid": 85, "question": "In 207, what is the part number and quantity for the Washer?"}
{"qid": 86, "question": "In 207, which line lists the O Ring, and how many are used?"}
{"qid": 87, "question": "In 207, what is the part number and quantity for the Semicircular Head Square Neck Bolt?"}
{"qid": 88, "question": "In 207, which line references the Outlet Nozzle Assembly, and what is its part number?"}
{"qid": 89, "question": "For the Left Cover Assembly (208), which items are labeled USB PCBA, and what are their part numbers?"}
{"qid": 90, "question": "In 208, how many total Nameplate line items appear, and what are their item numbers?"}
{"qid": 91, "question": "In 208, which line lists the Charging Harness Assembly, and what is its part number?"}
{"qid": 92, "question": "In 208, what is the part number and quantity for Charging Fuse (40A)?"}
{"qid": 93, "question": "In 208, what are the part numbers for Left Cover Plate and Left Cover?"}
{"qid": 94, "question": "For the Rear Guard Assembly (209), what is the part number and quantity for Guard Assembly?"}
{"qid": 95, "question": "In 209, what is the part number and quantity for LED Electric Assembly?"}
{"qid": 96, "question": "For the Right Cover Assembly (210), what are the part numbers for Right Cover Plate and Right Cover?"}
{"qid": 97, "question": "In 210, what is the quantity for Hexagon Socket Screw (part number 5620377003) used in that assembly?"}
{"qid": 98, "question": "For the Damping Seat Assembly (211), what is the part number and quantity for Armrest?"}
{"qid": 99, "question": "In 211, which lines list Right Armrest Assembly and Left Armrest Assembly, and what are their part numbers?"}
{"qid": 100, "question": "For the Accelerator (212), what is the part number and quantity for Accelerator PCBA?"}
